Revit 2022 API
ParameterUtils.GetParameterGroupTypeId Method
 Gets the ForgeTypeId identifying the built-in parameter group corresponding to BuiltInParameterGroup value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a future version of Revit. It will not be replaced, but until its removal it may be used to help migrate code that uses the 'BuiltInParameterGroup' enumeration to the ForgeTypeId class.")]
public static ForgeTypeId GetParameterGroupTypeId(
	BuiltInParameterGroup builtInParamGroup
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a future version of Revit. It will not be replaced, but until its removal it may be used to help migrate code that uses the 'BuiltInParameterGroup' enumeration to the ForgeTypeId class.")> _
Public Shared Function GetParameterGroupTypeId ( _
	builtInParamGroup As BuiltInParameterGroup _
) As ForgeTypeId
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2022 and may be removed in a future version of Revit. It will not be replaced, but until its removal it may be used to help migrate code that uses the 'BuiltInParameterGroup' enumeration to the ForgeTypeId class.")]
public:
static ForgeTypeId^ GetParameterGroupTypeId(
	BuiltInParameterGroup builtInParamGroup
)
Parameters
builtInParamGroup
Type: Autodesk.Revit.DB.BuiltInParameterGroup
The BuiltInParameterGroup value.
Return Value
Identifier of the parameter group corresponding to the given BuiltInParameterGroup value.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
ParameterUtils Class
Autodesk.Revit.DB Namespace